var list = [
  {
    "id": 1001,
    "text": "速度之靴"
  },
  {
    "id": 1004,
    "text": "仙女护符"
  },
  {
    "id": 1006,
    "text": "治疗宝珠"
  },
  {
    "id": 1011,
    "text": "巨人腰带"
  },
  {
    "id": 1018,
    "text": "灵巧披风"
  },
  {
    "id": 1026,
    "text": "爆裂魔杖"
  },
  {
    "id": 1027,
    "text": "蓝水晶"
  },
  {
    "id": 1028,
    "text": "红水晶"
  },
  {
    "id": 1029,
    "text": "布甲"
  },
  {
    "id": 1031,
    "text": "锁子甲"
  },
  {
    "id": 1033,
    "text": "抗魔斗篷"
  },
  {
    "id": 1036,
    "text": "长剑"
  },
  {
    "id": 1037,
    "text": "十字镐"
  },
  {
    "id": 1038,
    "text": "暴风之剑"
  },
  {
    "id": 1039,
    "text": "猎人的宽刃刀"
  },
  {
    "id": 1042,
    "text": "短剑"
  },
  {
    "id": 1043,
    "text": "反曲之弓"
  },
  {
    "id": 1051,
    "text": "格斗手套"
  },
  {
    "id": 1052,
    "text": "增幅典籍"
  },
  {
    "id": 1053,
    "text": "吸血鬼节杖"
  },
  {
    "id": 1054,
    "text": "多兰之盾"
  },
  {
    "id": 1055,
    "text": "多兰之刃"
  },
  {
    "id": 1056,
    "text": "多兰之戒"
  },
  {
    "id": 1057,
    "text": "负极斗篷"
  },
  {
    "id": 1058,
    "text": "无用大棒"
  },
  {
    "id": 1062,
    "text": "勘探者之刃"
  },
  {
    "id": 1063,
    "text": "勘探者之戒"
  },
  {
    "id": 1074,
    "text": "多兰之盾（大对决）"
  },
  {
    "id": 1075,
    "text": "多兰之刃（大对决）"
  },
  {
    "id": 1076,
    "text": "多兰之戒（大对决）"
  },
  {
    "id": 2003,
    "text": "生命药水"
  },
  {
    "id": 2004,
    "text": "法力药水"
  },
  {
    "id": 2009,
    "text": "活力夹心饼干"
  },
  {
    "id": 2010,
    "text": "活力夹心饼干"
  },
  {
    "id": 2041,
    "text": "水晶瓶"
  },
  {
    "id": 2043,
    "text": "真视守卫"
  },
  {
    "id": 2044,
    "text": "侦查守卫"
  },
  {
    "id": 2045,
    "text": "洞察红宝石"
  },
  {
    "id": 2047,
    "text": "神谕精粹"
  },
  {
    "id": 2049,
    "text": "洞察之石"
  },
  {
    "id": 2050,
    "text": "探索者守卫"
  },
  {
    "id": 2051,
    "text": "守护者的号角"
  },
  {
    "id": 2052,
    "text": "魄罗佳肴"
  },
  {
    "id": 2053,
    "text": "猛禽斗篷"
  },
  {
    "id": 2054,
    "text": "特制魄罗佳肴"
  },
  {
    "id": 2137,
    "text": "废墟合剂"
  },
  {
    "id": 2138,
    "text": "钢铁合剂"
  },
  {
    "id": 2139,
    "text": "巫术合剂"
  },
  {
    "id": 2140,
    "text": "愤怒合剂"
  },
  {
    "id": 3001,
    "text": "深渊权杖"
  },
  {
    "id": 3003,
    "text": "大天使之杖"
  },
  {
    "id": 3004,
    "text": "魔宗"
  },
  {
    "id": 3006,
    "text": "狂战士胫甲"
  },
  {
    "id": 3007,
    "text": "大天使之杖（水晶之痕）"
  },
  {
    "id": 3008,
    "text": "魔宗（水晶之痕）"
  },
  {
    "id": 3009,
    "text": "轻灵之靴"
  },
  {
    "id": 3010,
    "text": "催化神石"
  },
  {
    "id": 3020,
    "text": "法师之靴"
  },
  {
    "id": 3022,
    "text": "冰霜之锤"
  },
  {
    "id": 3023,
    "text": "双生暗影"
  },
  {
    "id": 3024,
    "text": "冰川护甲"
  },
  {
    "id": 3025,
    "text": "冰脉护手"
  },
  {
    "id": 3026,
    "text": "守护天使"
  },
  {
    "id": 3027,
    "text": "时光之杖"
  },
  {
    "id": 3028,
    "text": "和谐圣杯"
  },
  {
    "id": 3029,
    "text": "时光之杖（水晶之痕）"
  },
  {
    "id": 3031,
    "text": "无尽之刃"
  },
  {
    "id": 3035,
    "text": "最后的轻语"
  },
  {
    "id": 3040,
    "text": "炽天使之拥"
  },
  {
    "id": 3041,
    "text": "梅贾的窃魂卷"
  },
  {
    "id": 3042,
    "text": "魔切"
  },
  {
    "id": 3043,
    "text": "魔切"
  },
  {
    "id": 3044,
    "text": "净蚀"
  },
  {
    "id": 3046,
    "text": "幻影之舞"
  },
  {
    "id": 3047,
    "text": "忍者足具"
  },
  {
    "id": 3048,
    "text": "炽天使之拥"
  },
  {
    "id": 3050,
    "text": "基克的使徒"
  },
  {
    "id": 3056,
    "text": "干扰水晶"
  },
  {
    "id": 3057,
    "text": "耀光"
  },
  {
    "id": 3060,
    "text": "号令之旗"
  },
  {
    "id": 3065,
    "text": "振奋盔甲"
  },
  {
    "id": 3067,
    "text": "燃烧宝石"
  },
  {
    "id": 3068,
    "text": "日炎斗篷"
  },
  {
    "id": 3069,
    "text": "飞升护符"
  },
  {
    "id": 3070,
    "text": "女神之泪"
  },
  {
    "id": 3071,
    "text": "黑色切割者"
  },
  {
    "id": 3072,
    "text": "饮血剑"
  },
  {
    "id": 3073,
    "text": "女神之泪（水晶之痕）"
  },
  {
    "id": 3074,
    "text": "贪欲九头蛇（仅近战可用）"
  },
  {
    "id": 3075,
    "text": "荆棘之甲"
  },
  {
    "id": 3077,
    "text": "提亚马特（仅近战可用）"
  },
  {
    "id": 3078,
    "text": "三相之力"
  },
  {
    "id": 3082,
    "text": "守望者铠甲"
  },
  {
    "id": 3083,
    "text": "狂徒铠甲"
  },
  {
    "id": 3084,
    "text": "霸王血铠"
  },
  {
    "id": 3085,
    "text": "卢安娜的飓风（仅远程可用）"
  },
  {
    "id": 3086,
    "text": "狂热"
  },
  {
    "id": 3087,
    "text": "斯塔缇克电刃"
  },
  {
    "id": 3089,
    "text": "灭世者的死亡之帽"
  },
  {
    "id": 3090,
    "text": "沃格勒特的巫师帽"
  },
  {
    "id": 3091,
    "text": "智慧末刃"
  },
  {
    "id": 3092,
    "text": "冰霜女皇的旨令"
  },
  {
    "id": 3093,
    "text": "贪婪之刃"
  },
  {
    "id": 3096,
    "text": "游牧民印章"
  },
  {
    "id": 3097,
    "text": "巨神峰之擎"
  },
  {
    "id": 3098,
    "text": "冰霜之牙"
  },
  {
    "id": 3100,
    "text": "巫妖之祸"
  },
  {
    "id": 3101,
    "text": "蜂刺"
  },
  {
    "id": 3102,
    "text": "女妖面纱"
  },
  {
    "id": 3104,
    "text": "范达姆领主的劫掠者"
  },
  {
    "id": 3105,
    "text": "军团圣盾"
  },
  {
    "id": 3106,
    "text": "麦瑞德之爪"
  },
  {
    "id": 3108,
    "text": "恶魔法典"
  },
  {
    "id": 3110,
    "text": "冰霜之心"
  },
  {
    "id": 3111,
    "text": "水银之靴"
  },
  {
    "id": 3112,
    "text": "凛冬之魄"
  },
  {
    "id": 3113,
    "text": "以太精魂"
  },
  {
    "id": 3114,
    "text": "禁忌雕像"
  },
  {
    "id": 3115,
    "text": "纳什之牙"
  },
  {
    "id": 3116,
    "text": "瑞莱的冰晶节杖"
  },
  {
    "id": 3117,
    "text": "疾行之靴"
  },
  {
    "id": 3122,
    "text": "卑劣手斧"
  },
  {
    "id": 3124,
    "text": "鬼索的狂暴之刃"
  },
  {
    "id": 3134,
    "text": "残暴之力"
  },
  {
    "id": 3135,
    "text": "虚空之杖"
  },
  {
    "id": 3136,
    "text": "幽魂面具"
  },
  {
    "id": 3137,
    "text": "苦行僧之刃"
  },
  {
    "id": 3139,
    "text": "水银弯刀"
  },
  {
    "id": 3140,
    "text": "水银饰带"
  },
  {
    "id": 3141,
    "text": "神秘之剑"
  },
  {
    "id": 3142,
    "text": "幽梦之灵"
  },
  {
    "id": 3143,
    "text": "兰顿之兆"
  },
  {
    "id": 3144,
    "text": "比尔吉沃特弯刀"
  },
  {
    "id": 3145,
    "text": "海克斯科技左轮枪"
  },
  {
    "id": 3146,
    "text": "海克斯科技枪刃"
  },
  {
    "id": 3151,
    "text": "兰德里的折磨"
  },
  {
    "id": 3152,
    "text": "远古意志"
  },
  {
    "id": 3153,
    "text": "破败王者之刃"
  },
  {
    "id": 3154,
    "text": "瑞格之灯"
  },
  {
    "id": 3155,
    "text": "海克斯饮魔刀"
  },
  {
    "id": 3156,
    "text": "玛莫提乌斯之噬"
  },
  {
    "id": 3157,
    "text": "中娅沙漏"
  },
  {
    "id": 3158,
    "text": "明朗之靴"
  },
  {
    "id": 3159,
    "text": "基渣的幽魂之灯"
  },
  {
    "id": 3165,
    "text": "莫雷洛秘典"
  },
  {
    "id": 3166,
    "text": "骨齿项链"
  },
  {
    "id": 3167,
    "text": "骨齿项链"
  },
  {
    "id": 3168,
    "text": "骨齿项链"
  },
  {
    "id": 3169,
    "text": "骨齿项链"
  },
  {
    "id": 3171,
    "text": "骨齿项链"
  },
  {
    "id": 3172,
    "text": "灵风"
  },
  {
    "id": 3174,
    "text": "雅典娜的邪恶圣杯"
  },
  {
    "id": 3175,
    "text": "卡兹克的头颅"
  },
  {
    "id": 3180,
    "text": "奥黛恩的面纱"
  },
  {
    "id": 3181,
    "text": "血色之刃"
  },
  {
    "id": 3184,
    "text": "冰霜战锤"
  },
  {
    "id": 3185,
    "text": "光明使者"
  },
  {
    "id": 3187,
    "text": "海克斯科技探测器"
  },
  {
    "id": 3190,
    "text": "钢铁烈阳之匣"
  },
  {
    "id": 3191,
    "text": "探索者的护臂"
  },
  {
    "id": 3196,
    "text": "海克斯核心mk-1型"
  },
  {
    "id": 3197,
    "text": "海克斯核心mk-2型"
  },
  {
    "id": 3198,
    "text": "完美海克斯核心"
  },
  {
    "id": 3200,
    "text": "海克斯核心原型"
  },
  {
    "id": 3211,
    "text": "幽魂斗篷"
  },
  {
    "id": 3222,
    "text": "米凯尔的坩埚"
  },
  {
    "id": 3250,
    "text": "狂战士胫甲—家园卫士"
  },
  {
    "id": 3251,
    "text": "狂战士胫甲—统帅"
  },
  {
    "id": 3252,
    "text": "狂战士胫甲—喧哗"
  },
  {
    "id": 3253,
    "text": "狂战士胫甲—失真"
  },
  {
    "id": 3254,
    "text": "狂战士胫甲—欢欣"
  },
  {
    "id": 3255,
    "text": "法师之靴—家园卫士"
  },
  {
    "id": 3256,
    "text": "法师之靴—统帅"
  },
  {
    "id": 3257,
    "text": "法师之靴—喧哗"
  },
  {
    "id": 3258,
    "text": "法师之靴—失真"
  },
  {
    "id": 3259,
    "text": "法师之靴—欢欣"
  },
  {
    "id": 3260,
    "text": "忍者足具—家园卫士"
  },
  {
    "id": 3261,
    "text": "忍者足具—统帅"
  },
  {
    "id": 3262,
    "text": "忍者足具—喧哗"
  },
  {
    "id": 3263,
    "text": "忍者足具—失真"
  },
  {
    "id": 3264,
    "text": "忍者足具—欢欣"
  },
  {
    "id": 3265,
    "text": "水银之靴—家园卫士"
  },
  {
    "id": 3266,
    "text": "水银之靴—统帅"
  },
  {
    "id": 3267,
    "text": "水银之靴—喧哗"
  },
  {
    "id": 3268,
    "text": "水银之靴—失真"
  },
  {
    "id": 3269,
    "text": "水银之靴—欢欣"
  },
  {
    "id": 3270,
    "text": "疾行之靴—家园卫士"
  },
  {
    "id": 3271,
    "text": "疾行之靴—统帅"
  },
  {
    "id": 3272,
    "text": "疾行之靴—喧哗"
  },
  {
    "id": 3273,
    "text": "疾行之靴—失真"
  },
  {
    "id": 3274,
    "text": "疾行之靴—欢欣"
  },
  {
    "id": 3275,
    "text": "明朗之靴—家园卫士"
  },
  {
    "id": 3276,
    "text": "明朗之靴—统帅"
  },
  {
    "id": 3277,
    "text": "明朗之靴—喧哗"
  },
  {
    "id": 3278,
    "text": "明朗之靴—失真"
  },
  {
    "id": 3279,
    "text": "明朗之靴—欢欣"
  },
  {
    "id": 3280,
    "text": "轻灵之靴—家园卫士"
  },
  {
    "id": 3281,
    "text": "轻灵之靴—统帅"
  },
  {
    "id": 3282,
    "text": "轻灵之靴—喧哗"
  },
  {
    "id": 3283,
    "text": "轻灵之靴—失真"
  },
  {
    "id": 3284,
    "text": "轻灵之靴—欢欣"
  },
  {
    "id": 3285,
    "text": "卢登的回声"
  },
  {
    "id": 3290,
    "text": "双生暗影"
  },
  {
    "id": 3301,
    "text": "上古钱币"
  },
  {
    "id": 3302,
    "text": "圣物之盾"
  },
  {
    "id": 3303,
    "text": "窃法之刃"
  },
  {
    "id": 3340,
    "text": "监视图腾（饰品）"
  },
  {
    "id": 3341,
    "text": "扫描透镜（饰品）"
  },
  {
    "id": 3342,
    "text": "占卜宝珠（饰品）"
  },
  {
    "id": 3345,
    "text": "灵魂之锚"
  },
  {
    "id": 3361,
    "text": "高级侦查图腾（饰品）"
  },
  {
    "id": 3362,
    "text": "高级真视图腾（饰品）"
  },
  {
    "id": 3363,
    "text": "远见宝珠（饰品）"
  },
  {
    "id": 3364,
    "text": "神谕透镜（饰品）"
  },
  {
    "id": 3401,
    "text": "山岳之容"
  },
  {
    "id": 3405,
    "text": "骨齿项链"
  },
  {
    "id": 3406,
    "text": "骨齿项链"
  },
  {
    "id": 3407,
    "text": "骨齿项链"
  },
  {
    "id": 3408,
    "text": "骨齿项链"
  },
  {
    "id": 3409,
    "text": "骨齿项链"
  },
  {
    "id": 3410,
    "text": "卡兹克的头颅"
  },
  {
    "id": 3411,
    "text": "骨齿项链"
  },
  {
    "id": 3412,
    "text": "骨齿项链"
  },
  {
    "id": 3413,
    "text": "骨齿项链"
  },
  {
    "id": 3414,
    "text": "骨齿项链"
  },
  {
    "id": 3415,
    "text": "骨齿项链"
  },
  {
    "id": 3416,
    "text": "卡兹克的头颅"
  },
  {
    "id": 3417,
    "text": "骨齿项链"
  },
  {
    "id": 3418,
    "text": "骨齿项链"
  },
  {
    "id": 3419,
    "text": "骨齿项链"
  },
  {
    "id": 3420,
    "text": "骨齿项链"
  },
  {
    "id": 3421,
    "text": "骨齿项链"
  },
  {
    "id": 3422,
    "text": "卡兹克的头颅"
  },
  {
    "id": 3450,
    "text": "骨齿项链"
  },
  {
    "id": 3451,
    "text": "骨齿项链"
  },
  {
    "id": 3452,
    "text": "骨齿项链"
  },
  {
    "id": 3453,
    "text": "骨齿项链"
  },
  {
    "id": 3454,
    "text": "骨齿项链"
  },
  {
    "id": 3455,
    "text": "卡兹克的头颅"
  },
  {
    "id": 3460,
    "text": "金色传送器"
  },
  {
    "id": 3504,
    "text": "炽热香炉"
  },
  {
    "id": 3508,
    "text": "夺萃之镰"
  },
  {
    "id": 3512,
    "text": "兹若特传送门"
  },
  {
    "id": 3599,
    "text": "黑色长矛"
  },
  {
    "id": 3706,
    "text": "追猎者的刀锋"
  },
  {
    "id": 3707,
    "text": "追猎者的刀锋—战士"
  },
  {
    "id": 3708,
    "text": "追猎者的刀锋—圣贤"
  },
  {
    "id": 3709,
    "text": "追猎者的刀锋—熔渣巨人"
  },
  {
    "id": 3710,
    "text": "追猎者的刀锋—吞噬者"
  },
  {
    "id": 3711,
    "text": "偷猎者的匕首"
  },
  {
    "id": 3713,
    "text": "巡林者的利器"
  },
  {
    "id": 3714,
    "text": "游击者的军刀—战士"
  },
  {
    "id": 3715,
    "text": "游击者的军刀"
  },
  {
    "id": 3716,
    "text": "游击者的军刀—圣贤"
  },
  {
    "id": 3717,
    "text": "游击者的军刀—熔渣巨人"
  },
  {
    "id": 3718,
    "text": "游击者的军刀—吞噬者"
  },
  {
    "id": 3719,
    "text": "偷猎者的匕首—战士"
  },
  {
    "id": 3720,
    "text": "偷猎者的匕首—圣贤"
  },
  {
    "id": 3721,
    "text": "偷猎者的匕首—熔渣巨人"
  },
  {
    "id": 3722,
    "text": "偷猎者的匕首—吞噬者"
  },
  {
    "id": 3723,
    "text": "巡林者的利器—战士"
  },
  {
    "id": 3724,
    "text": "巡林者的利器—圣贤"
  },
  {
    "id": 3725,
    "text": "巡林者的利器—熔渣巨人"
  },
  {
    "id": 3726,
    "text": "巡林者的利器—吞噬者"
  },
  {
    "id": 3751,
    "text": "斑比的熔渣"
  },
  {
    "id": 3800,
    "text": "正义荣耀"
  },
  {
    "id": 3801,
    "text": "晶体护腕"
  }
];